[
  {
    "id": "blog-007",
    "title": "Story: Softy the Slug & Crabby the Crab",
    "tags": "story",
    "date": "2025-10-21",
    "content": "<p>A little realization that I turned into ashort children story</p><hr><p>Softy the Slug lived near the river, under the damp leaves. He was squishy, slow, and gentle. One day, Crabby the Crab saw him. His shell was shiny and hard like a rock.</p><p>“Look at you!” Crabby laughed. “You’re so soft! I could pinch you and you’d pop!”</p><p>Crabby poked and pinched Softy. Softy winced. The pinches hurt. Little tears formed on his body.</p><p>“I may be soft,” Softy said quietly, “but I still feel things.”</p><p>Crabby rolled his eyes and clacked his pinchers. “Soft things break so easily.”</p><p>Just then: <strong>THUMP!</strong> A heavy stone tumbled from above and landed on top of them!</p><p>Softy squished flat like jelly and slid out from under the stone easily. But Crabby was stuck. The stone pressed hard against his shell. He groaned. <strong>Crack!</strong> A tiny line split across his back.</p><p>“Ow! I can’t move!” Crabby cried.</p><p>Softy turned back. “Hold on,” he said. He wriggled under the stone, found a small gap, and pushed with all his squishy strength. Bit by bit, Crabby slid free.</p><p>Crabby looked back at his cracked shell. “I… I thought being hard made me strong. But now I’m broken.”</p><p>Softy peeked at Crabby’s cracked shell and gently hugged him with his soft, slimy body.</p><p>“Being soft can hurt sometimes,” Softy said, “but being soft also means I can give tight hugs.”</p><p>Crabby blinked. No one had ever hugged him before.</p><p>He looked at his cracked shell again. “I didn’t know I had soft parts inside too,” Crabby whispered.</p><p>Softy nodded. “I think that’s beautiful.”</p><p>Crabby hid in his home, waiting for his crack to heal slowly. Softy brought him food every day, already fully healed from all the tears Crabby had pinched into him.</p><p>From that day on, Crabby never mocked softness again. He learned that strength isn’t just about being tough. Sometimes, it’s about being kind.</p><hr><br><p><strong>The story behind the story</strong></p><p>I was stepping off my motorcycle to get gas and I accidentally slipped my step. My inner thigh got pinched between my leg and the motorcycle’s side body.</p><p>While the gas station employee filled up my tank, I thought, “Only soft organisms can be pinched (their skin gets squeezed by parallel pressure). Hard-shelled animals should be more sensitive to pressing force from above, because it can crack their shells.”</p><p>Then, when riding home, I kept thinking about how this relates to human attitudes. Sometimes we feel arrogant, like we can do anything. But that arrogance can easily shatter into humiliation. In that moment of humiliation, only a few people find humility. A realization of self-worth.</p><p>Those who truly reflect on that humility can finally learn to apologize, forgive, or try to understand. That’s strength and growth. But it’s often mistaken for weakness.</p>"
  },

  {
    "id": "blog-006",
    "title": "Quote: Illusion of stability",
    "tags": "quote",
    "date": "2025-10-17",
    "content": "'Even the most stable empires are only 3 meals away from chaos.'"
  },

  {
    "id": "blog-005",
    "title": "Quote: Changes",
    "tags": "quote",
    "date": "2025-10-16",
    "content": "'No man ever steps in the same river twice, for it is not the same river and he is not the same man.'"
  },

  {
    "id": "blog-004",
    "title": "Quote: Memory",
    "tags": "quote",
    "date": "2025-10-13",
    "content": "'The shortest pencil is longer than the longest memory.'"
  },

  {
    "id": "blog-003",
    "title": "Thought: Handcrafting this site",
    "tags": "thought",
    "date": "2025-10-11",
    "content": "My search for a suitable platform to share thoughts & creations often leads to compromise. Medium feels too social, Substack feels too demanding, Twitter feels too hostile, & platforms like Blogspot or WordPress impose limitations that stifle creative freedom. In response to this, the decision was made to build a personal site, handcrafted from scratch & entirely under total control.<br><br> While the technical background was modest (having previously created simple websites & tools for friends), the love to design & create remained strong. This process, however, diverged significantly from traditional design workflows. Unlike CAD or other visual tools where design flows directly from the cursor, web development demands a more procedural mindset. It requires thinking in terms of relationships, mechanisms, & logic. It's less visually intuitive, yet surprisingly sleek & structured.<br><br> In spatial & graphical design, the process typically begins with a broad concept, followed by layout planning, room structuring, furniture placement, & finally, detailing. One does not begin with the toilet (unless designing a public restroom). Website design, in contrast, allows for a more fluid approach. Once the desired aesthetic was defined: brutalist, gritty, barebones, the rest followed organically. It's like designing a room that needs to dynamically adapt its modular components to it's user's needs. The guiding question became: “How can this component reflect that raw, dirty aesthetic?” With the style & mechanism established, every other element aligned naturally.<br><br> The most liberating aspect of this endeavor was the autonomy it provided. Anything could work. Every decision was unconstrained by platform norms or external expectations. References from design studios & software development portfolios offered valuable insight. While software-dev sites often prioritize flawless functionality, designer portfolios embrace unconventionality. The latter proved especially inspiring: bold, expressive, & unapologetically unique. Having no formal background & demand in website designing was not a limitation, but quite the opposite: a blank canvas that is free to be drawn with anything, not be constrained by industry conformity.<br><br> This project became more than just a website. It is a personal space, shaped by instinct & intention, where design met freedom & form followed feeling. Pure creation & expression. It's liberating. It's inspiring to be more liberated in other platform of design."
  },

  {
    "id": "blog-002",
    "title": "Site: Project contents",
    "tags": "site",
    "date": "2025-10-10",
    "content": "The contents for the project pages are not ready yet. Will work on that after the end of December. Kinda overwhelmed with deadlines until then."
  },

  {
    "id": "blog-001",
    "title": "Site: Launched",
    "tags": "site",
    "date": "2025-10-09",
    "content": "This site is now live. Fully functional statically. More contents coming."
  }
]
