[
  {
    "id": "blog-005",
    "title": "Quote: Changes",
    "tags": "quote",
    "date": "2025-10-16",
    "content": "'No man ever steps in the same river twice, for it is not the same river and he is not the same man.'"
  },

  {
    "id": "blog-004",
    "title": "Quote: Memory",
    "tags": "quote",
    "date": "2025-10-13",
    "content": "'The shortest pencil is longer than the longest memory.'"
  },

  {
    "id": "blog-003",
    "title": "Thought: Handcrafting this site",
    "tags": "thought",
    "date": "2025-10-11",
    "content": "My search for a suitable platform to share thoughts & creations often leads to compromise. Medium feels too social, Substack feels too demanding, Twitter feels too hostile, & platforms like Blogspot or WordPress impose limitations that stifle creative freedom. In response to this, the decision was made to build a personal site, handcrafted from scratch & entirely under total control.<br><br> While the technical background was modest (having previously created simple websites & tools for friends), the love to design & create remained strong. This process, however, diverged significantly from traditional design workflows. Unlike CAD or other visual tools where design flows directly from the cursor, web development demands a more procedural mindset. It requires thinking in terms of relationships, mechanisms, & logic. It's less visually intuitive, yet surprisingly sleek & structured.<br><br> In spatial & graphical design, the process typically begins with a broad concept, followed by layout planning, room structuring, furniture placement, & finally, detailing. One does not begin with the toilet (unless designing a public restroom). Website design, in contrast, allows for a more fluid approach. Once the desired aesthetic was defined: brutalist, gritty, barebones, the rest followed organically. It's like designing a room that needs to dynamically adapt its modular components to it's user's needs. The guiding question became: “How can this component reflect that raw, dirty aesthetic?” With the style & mechanism established, every other element aligned naturally.<br><br> The most liberating aspect of this endeavor was the autonomy it provided. Anything could work. Every decision was unconstrained by platform norms or external expectations. References from design studios & software development portfolios offered valuable insight. While software-dev sites often prioritize flawless functionality, designer portfolios embrace unconventionality. The latter proved especially inspiring: bold, expressive, & unapologetically unique. Having no formal background & demand in website designing was not a limitation, but quite the opposite: a blank canvas that is free to be drawn with anything, not be constrained by industry conformity.<br><br> This project became more than just a website. It is a personal space, shaped by instinct & intention, where design met freedom & form followed feeling. Pure creation & expression. It's liberating. It's inspiring to be more liberated in other platform of design."
  },

  {
    "id": "blog-002",
    "title": "Site: Project contents",
    "tags": "site",
    "date": "2025-10-10",
    "content": "The contents for the project pages are not ready yet. Will work on that after the end of December. Kinda overwhelmed with deadlines until then."
  },

  {
    "id": "blog-001",
    "title": "Site: Launched",
    "tags": "site",
    "date": "2025-10-09",
    "content": "This site is now live. Fully functional statically. More contents coming."
  }
]
